Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: Determining that an expression t is a correct proof of assertion p would then simply be a matter of checking that t has type Proof p.
ko: 표현식 t는 주장 p의 올바른 증명이다를 결정하는 것은 t가 Proof p형임을 확인하는 문제가 됩니다.

source: Disjunction
ko: 분리자

source: Displaying Information
ko: 정보 표시하기

source: Distributivity:
ko: 분배성:

source: Double-negation elimination allows one to prove any proposition, p, by assuming ¬p and deriving false, because that amounts to proving ¬¬p.
ko: 이중 부정 제거는 여러분에게 어떤 명제 p에 대해서 ¬p를 가정하면 ¬¬p의 증명을 고려하기 때문에 false를 유도할 수 있게 허용해 줍니다.<부분 1098 ¶>

source: Each <proof>_i is a proof for <expr>_{i-1} op_i <expr>_i.
ko: 각 <proof>_i는 <expr>_{i-1} op_i <expr>_i에 대한 증명입니다.

source: Each constructor c in the definition of a family C of inductive types is of the form
ko: 귀납형의 C 군의 정의에서 각 생성자 c는 다음 형태와 같습니다.

source: Each constructor should have a type, where the argument types are built up from previously defined types, the parameter and index types, and the inductive family currently being defined.
ko: 각 생성자는 이전에 정의된 유형, 매개변수와 색인 유형, 현재 정의 중인 귀납군으로 만들어져서 유형을 가져야만 합니다.

source: Each constructor then constructs an element of some member of the family.
ko: 그럼 각 생성자는 군의 일부 구성원의 원소를 생성합니다.

source: Each line should contain the same number of patterns, one for each element of β.
ko: 각 줄은 β의 각 원소에 대해 한 개씩 같은 수의 패턴을 포함해야 합니다.

source: Each style has its own advantages and disadvantages.
ko: 각 스타일은 그것의 장단점을 가지고 있습니다.

source: Editor shortcut
ko: 편집 단축기(Editor shortcut)

source: Ellipses are also useful when explicit argument can be automatically inferred by Lean, and we want to avoid a sequence of _s.
ko: Ellipses도 명시적인 인자가 린으로부터 자동적으로 추론될 수 있을 때와 우리가 _들의 나열을 피하고자 할 때 유용합니다.

source: Entering Tactic Mode
ko: 전략 모드 진입

source: Enumerated Types
ko: 열거 유형

source: Enumerated types are a very special case of inductive types, in which the constructors take no arguments at all.
ko: 열거 유형은 귀납형의 아주 특별한 경우 입니다. 이들의 생성자는 인수를 전혀 받지 않습니다.

source: Equality
ko: 동등성

source: Equality is much more than an equivalence relation, however.
ko: 하지만 동등은 등가 관계 그 이상입니다.

source: Essentially, it just checks that the given term has the indicated type.
ko: 본질적으로 어떤 항이 가리키는 유형을 갖는 것을 확인합니다.

source: Essentially, the rw tactic uses a given equality (which can be a hypothesis, a theorem name, or a complex term) to "rewrite" the goal.
ko: 본질적으로 rw 전략은 주어진 동등성을 목표(혹은 가정, 정리, 복잡한 항이 될 수도 있음)를 "다시 쓰는데" 사용합니다.

source: Even the existential quantifier is inductively defined:
ko: 심지어 존재 한정기호도 유도적으로 정의됩니다.

source: Every natural number is either zero or succ x, and so you can define a function from the natural numbers to an arbitrary type by specifying a value in each of those cases:
ko: 모든 자연수는 zero이거나 succ x입니다. 그래서 여러분은 각 경우에 대한 값을 나타내줌으로써 자연수에서 임의의 유형으로 가는 함수를 정의할 수 있습니다.

source: Every structure declaration introduces a namespace with the same name.
ko: 모든 structure 선언은 같은 이름을 가진 이름공간을 도입합니다.

source: Every element of a function type α → β or a dependent function type (a : α) → β is assumed to have a value at every input.
ko: α → β형 함수나 (a : α) → β형 의존 함수의 모든 원소는 매 입력에 대한 함숫값을 갖는다고 가정됩니다.

source: Examples of Propositional Validities
ko: 명제 유효성 예제

source: Exercises
ko: 연습문제

source: False
ko: 거짓

source: Fill in the definitions of prime and Fermat_prime below, and construct each of the given assertions.
ko: 아래의 prime과 Fermat_prime의 정의를 채우세요. 그리고 주어진 주장의 각각을 생성하세요.

source: Finally, we have to show q.
ko: 마지막으로 q임을 보여야 합니다.

source: Finally, applying it to the hypothesis hbc yields a proof of the conclusion r a c.
ko: 마침내, 이것을 가정 hbc에 적용하는 것으로 결론 r a c의 증명을 거둡니다.

source: Finally, consider the existential quantifier, which can be written as either exists x : α, p x or ∃ x : α, p x.
ko: 마지막으로 exists x : α, p x나 ∃ x : α, p x으로 쓸 수 있는 존재 한정기호를 고려해봅시다.

source: Finally, the t : Nat, is the input to the function.
ko: 마침내 t : Nat가 함수에 대한 입력입니다.

source: Finally, the last step applies associativity in the reverse direction rewriting a + (c + b) to a + c + b.
ko: 마침내 마지막 단계는 a + (c + b)에서 a + c + b으로 다시쓰기를 역방향으로 결합성을 적용합니다.

source: Finally, you will learn about features that are specific to Lean, including the language you use to communicate with the system, and the mechanisms Lean offers for managing complex theories and data.
ko: 마지막으로 린에 여러분이 시스템과 소통하기 위해 사용하는 언어와 복잡한 이론과 자료를 관리하기 위해 린이 제공하는 메커니즘을 포함하는 구체적인 특징에 대해 배웁니다.

source: First, Lean supports mutually defined inductive types.
ko: 우선 린은 귀납형의 상호적으로 정의됨(mutually defined)을 지원합니다.

source: First, the application of a function f to a value x is denoted f x (e.g., Nat.succ 2).
ko: 우선 함수 f에 값 x의 활용은 f x 를 지칭합니다. (예를 들어 Nat.succ 2)

source: First, we have to show that it indeed suffices to show q, by proving the original goal of q ∧ p with the additional hypothesis hq : q.
ko: 우선, 우리는 원래 목표q ∧ p 과 추가적인 가정 hq : q으로 증명함으로써 q임을 충분히 보일 수 있는 것을 보여야 합니다.

source: Fixing m, we can define addition by recursion on n.
ko: m을 고치면 우리는 n에 대한 재귀로부터 덧셈을 정의할 수 있습니다.

source: Following the examples in Section Dependent Pattern Matching, define a function that will append two vectors.
ko: 종속 패턴 매칭 섹션의 다음 예제는 벡터에 벡터를 추가하는 함수를 정의합니다.

source: For any type, α, the type List α of lists of elements of α is defined in the library.
ko: 임의의 유형 α에 대한 α 원소의 리스트 List α형은 라이브러리에 정의됩니다.

source: For example, a ∧ b → c ∨ d ∧ e means (a ∧ b) → (c ∨ (d ∧ e)).
ko: 예를 들어 a ∧ b → c ∨ d ∧ e은 (a ∧ b) → (c ∨ (d ∧ e))을 의미합니다.

source: For example, for the expression if p then a else b to make sense, we need to know that p is decidable.
ko: 예를 들어 표현식 if p then a else b를 이해하려면 우리는 p가 결정 가능인지 알 필요가 있습니다.

source: For example, it would be more natural to define the previous example as a function of two arguments:
ko: 예를 들어 이전 예제를 두 인수를 받는 함수로 정의하는 것이 더 자연스럽습니다.

source: For example, tactic-style proofs can be harder to read, because they require the reader to predict or guess the results of each instruction.
ko: 예를 들어, 전략 스타일의 증명은 독자가 각 명령의 결과를 예측하거나 추측해야 하기 때문에 읽기가 더 어려울 수 있습니다.

source: For example, the following defines a record to store a color as a triple of RGB values:
ko: 예를 들어 다음은 RGB 3개의 값을 갖는 triple로서 색을 저장하는 레코드를 정의합니다.

source: For example, the product type comes with the following operations:
ko: 예를들어 곱 유형은 다음 연산을 동반합니다.

source: For example, the tactic apply And.intro tagged the first sugoal as left, and the second as right.
ko: 예를 들어, 전략 apply And.intro는 첫번째 목표를 left으로 두번째 목표를 right으로 표식을 붙입니다.

source: For example, the variable b in the expression fun (b : β) (x : α) => b has nothing to do with the constant b declared earlier.
ko: 예를 들어 표현식 fun (b : β) (x : α) => b 속 변수 b는 앞서 선언된 상수 b와는 아무런 연관이 없습니다.

source: For example, we can use it to postulate the empty type False has an element.
ko: 예를 들어 우리는 그것을 빈 유형 False이 원소를 갖는다고 가정하는데 사용할 수 있습니다.

source: For another example, consider the type Vector α n, the type of vectors of elements of α of length n.
ko: 또 다른 예시로 유형 Vector α n을 고려해보세요. 이 벡터의 유형은 길이 n인 α를 원소로 하는 리스트입니다.

source: For another example, let us prove the associativity of addition, ∀ m n k, m + n + k = m + (n + k).
ko: 다른 예제에서 덧셈의 결합성 ∀ m n k, m + n + k = m + (n + k)을 증명해 봅시다.

source: For another example, suppose we use a nested inductive type to define a set of terms inductively, so that a term is either a constant (with a name given by a string), or the result of applying a constant to a list of constants.
ko: 또 다른 예제에서 우리가 중접된 귀납형을 재귀적으로 항들의 집합을 정의하고자 사용한다고 합시다. 그러면 항은 (문자열로 이름이 주어진)상수이거나 상수의 리스트에 상수를 적용한 결과입니다.

source: For another example, we can define the type of binary trees:
ko: 또 다른 예제로 우리는 이진 트리의 유형을 정의할 수 있습니다.

source: For another example, we can use the instance command to assign the notation ≤ to the isPrefix relation.
ko: 다른 예제에서 우리는 instance 명령을 isPrefix관계에 ≤기호를 부여하는 데 사용할 수 있습니다.

source: For each constructor c as above, and each βk[a] in the sequence β[a], if βk[a] : Sort v, we have u ≥ v.
ko: 위처럼 각 생성자 c와 β[a]열에서 각 βk[a]에 대해 만약 βk[a] : Sort v이면 u ≥ v이다.

source: For each fixed α : Sort u and a : α, this definition constructs a family of types Eq a x, indexed by x : α.
ko: 각 고정된 α : Sort u와 a : α에 대해 이 정의는 x : α으로 색인된 Eq a x형의 군을 생성합니다.

source: For every p q : Prop, p ∧ q is an example: the canonical way to construct an element is to apply And.intro to suitable arguments hp : p and hq : q.
ko: 모든 p q : Prop에 대해 p ∧ q가 예제입니다. 원소를 생성하는 정식 방법은 And.intro를 적절한 인수 hp : p과 hq : q에 대해 적용하는 것입니다.

source: For example, all_goals t applies t to all open goals:
ko: 예를 들어 all_goals t는 모든 끝나지 않은 목표에 t를 적용합니다.

source: For example, suppose we declare a structure in Lean to hold implementations of addition
ko: 예를 들어 덧셈의 구현을 유지하기 위해 린에 구조체를 선언한다고 해봅시다.

source: For example, using the hypothesis p, it rewrites p ∧ q to q and p ∨ q to true, which it then proves trivially.
ko: 예를 들어 가정 p를 사용하여 이것은 p ∧ q을 q으로 그리고 p ∨ q을 true으로 다시 쓴다. 그럼 이를 명백하게 증명합니다.

source: For example, you can declare an (anonymous) instance stating that if a has addition, then Array a has addition:
ko: 예를 들어 여러분이 (익명) 개체를 a가 덧셈을 갖는다면 Array a도 덧셈을 갖는다고 서술해 선언할 수 있습니다.

source: For example, (+1) is sugar for fun x, x + 1.
ko: 예를 들어 (+1)은 fun x, x + 1에 대한 설탕입니다.

source: For example, List α should make sense for any type α, no matter which type universe α lives in.
ko: 예를 들어 α가 어떤 유형 세계에 있던간에 List α는 임의의 유형 α에 대해 의미가 있어야 합니다.

source: For example, t can be a hypothesis h : x = y in the context; it can be a general lemma, like add_comm : ∀ x y, x + y = y + x, in which the rewrite tactic tries to find suitable instantiations of x and y; or it can be any compound term asserting a concrete or general equation.
ko: 예를 들어 t는 맥락 속에서 가정 h : x = y이 될 수 있습니다. 그것은 add_comm : ∀ x y, x + y = y + x같은 일반적인 보조정리일 수 있고, 여기서 다시쓰기 전략은 x와 y 적절한 개체화를 발견하려고 노력합니다. 아니면 이것은 일반적인 방정식 혹은 구체적인 방정식을 주장하는 임의의 복합적인 항이 될 수도 있습니다.

source: For example, Lean cannot find an instance of Inhabited (Set α).
ko: 예를 들어 Inhabited (Set α)의 개체를 찾을 수 없습니다.

source: For example, Lean groups definitions and theorems involving lists into a namespace List.
ko: 예를 들어 Lean은 이름공간 List 속에 리스트를 포함한 정의와 정리를 묶습니다.

source: For example, if a and b are types, a -> b denotes the type of functions from a to b, and a × b denotes the type of pairs consisting of an element of a paired with an element of b, also known as the Cartesian product.
ko: 예를 들어 a와 b가 유형이라면 a -> b는 a 에서 b로 가는 함수 유형을 나타냅니다. 그리고 a × b 는 a의 원소와 b의 원소로 이뤄진 쌍을 원소로 갖는 유형을 나타냅니다. 이것을 카테시안 곱이라 합니다.

source: For example, if a is a type, exists x : a, x = x is true only if a is not empty.
ko: 예를 들어 a가 유형이면 exists x : a, x = x은 a가 비어있지 않을 때에만 참입니다.

source: For example, if we have have hg : g 0 0 = 0 and write Exists.intro 0 hg, there are many possible values for the predicate p, corresponding to the theorems ∃ x, g x x = x, ∃ x, g x x = 0, ∃ x, g x 0 = x, etc.
ko: 예를 들어 우리가 have hg : g 0 0 = 0를 갖고 있고 Exists.intro 0 hg을 썼다면 정리 ∃ x, g x x = x, ∃ x, g x x = 0, ∃ x, g x 0 = x 등에 대응하는 술어 p에 대해 수없이 많은 가능한 값이 존재합니다.

source: For example, in a given context, x + 0 may denote a natural number and f may denote a function on the natural numbers.
ko: 예를들어 어떤 맥락에서 x + 0은 자연수를 가리키고 f은 자연수에 대한 함수를 지칭합니다.

source: For example, in many proof systems for propositional logic, we have the rule of modus ponens:
ko: 예를 들어 명제논리에 대한 많은 증명보조기들은 전건긍정(modus ponens)에 대한 규칙을 갖고 있습니다.

source: For example, it allows you to "partially apply" the function Nat.add.
ko: 예를 들어 이는 여러분에게 함수 Nat.add의 "부분 적용"을 허용합니다.

source: For example, one can carry out a proof by cases:
ko: 예를 들어 누군가는 경우를 나눠 증명을 도출할 수 있습니다.

source: For example, reverting x in the example above brings h along with it:
ko: 예를 들어 위의 예제에서 x를 되돌려 놓는 것은 그것과 붙은 h를 가져옵니다.

source: For example, suppose xs has type α, when elaboration xs.map (fun x => 2 * x), we want the homogeneous instance for multiplication to have higher priority than the default instance for OfNat.
ko: 예를 들어 xs.map (fun x => 2 * x)으로 해석될 때 xs가 α형이라고 가정합시다. 우리는 OfNat에 대한 기본 개체보다 더 높은 우선 순위를 갖는 곱셈에 대한 동형 개체를 원합니다.

source: For example, suppose we define a list operation that symmetrizes its input by appending its reversal:
ko: 예를 들어 우리가 그것의 입력을 그것의 거꾸로 추가하여 대칭시키는 리스트 연산을 정의한다고 합시다.

source: For example, term rewriting, and Lean's automated methods for simplifying terms and expressions automatically.
ko: 예를 들어, 항을 다시 쓰기(rewriting)와 Lean의 자동화된 항과 식의 단순화(simplifying) 기법

source: For example, the definition of addition may also be written as follows:
ko: 예를 들어 덧셈의 정의는 다음과 같이 작성될 수 있습니다.

source: For example, the following creates the goal of constructing a term of type p ∧ q ∧ p, in a context with constants p q : Prop, hp : p and hq : q:
ko: 예를 들어 , 다음은 p ∧ q ∧ p형의 항을 상수 p q : Prop과 hp : p,hq : q가 있는 현재 상황에 대해 생성하는 목표를 만듭니다.

source: For example, the following definition shows that if two types a and b are inhabited, then so is their product:
ko: 예를 들어 다음 정의는 만약 두 유형 a와 b가 내재되었다면 그들의 곱도 그렇다는 것을 보여줍니다.

source: For example, the following implication requires classical reasoning because, from a constructive standpoint, knowing that it is not the case that every x satisfies ¬ p is not the same as having a particular x that satisfies p.
ko: 예를 들어, 직관주의적 관점에서 모든 x가 ¬p을 만족하는 경우가 아니라는 것을 아는 것은 p를 만족하는 특정 x를 갖는 것과 같지 않기 때문에 다음의 함의는 고전적인 추론을 필요로 합니다.

source: For example, the following two expressions mean the same thing:
ko: 예를 들어 다음 두 표현식은 같은 것을 의미합니다.

source: For example, the local variable a occurs at let rec loop.
ko: 예를 들어 지역변수 a는 let rec loop에 나타납니다.

source: For example, the tactics apply and exact expect arbitrary terms, which you can write using have, show, and so on.
ko: 예를 들어 apply 와exact 전략은 have, show 등등을 사용해 만든 임의의 항을 기대합니다.

source: For example, the theorem named le_of_succ_le_succ in the namespace Nat has full name Nat.le_of_succ_le_succ, but the shorter name is made available by the command open Nat (for names not marked as protected).
ko: 예를 들어, 정리는 이름공간 Nat 에서 le_of_succ_le_succ으로 이름지어진 정리는 Nat.le_of_succ_le_succ을 긴 이름으로 갖습니다. 그러나 더 짧은 이름은 open Nat 명령으로 사용할 수 있게 됩니다.(protected로 표시된 이름을 제외하고)

source: For example, using the abbreviation rw for rewrite, the proof above could be written as follows:
ko: 예를 들어, 다시쓰기에 대해서 간략히 rw를 쓰는 것으로 위의 증명은 다음과 같이 다시 쓸 수 있습니다.

source: For example, we use this notation to define "points." The order that the fields are specified does not matter, so all the expressions below define the same point.
ko: 예를 들어 우리는 "점"을 정의하기 위해 이 기호를 사용합니다. 필드가 나타난 순서는 중요하지 않습니다. 그래서 아래의 모든 표현식들은 같은 점을 정의합니다.

source: For example, we can fill the goals above in the opposite order:
ko: 예를 들어 우리는 위의 목표를 반대 순서로 채울 수 있습니다.

source: For example, we can prove the decidability of basic operations like equality and comparisons on the natural numbers and the integers.
ko: 예를 들어 우리는 자연수와 정수에 대한 등식과 부등식 같은 기본 연산의 결정 가능성을 증명할 수 있습니다.

source: For example, we can put the numberOfDay function in the Weekday namespace.
ko: 예를 들어, 우리는 Weekday 이름공간에 numberOfDay함수를 넣을 수 있습니다.

source: For example, we could introduce a new type, Prop, to represent propositions, and introduce constructors to build new propositions from others.
ko: 예를 들어, 우리는 새로운 유형 Prop을 명제를 나타내기 위해 도입할 수 있습니다. 그리고 다른 유형으로부터 새로운 명제를 만드는 생성자를 도입할 수 있습니다.

source: For example, when applied to a goal of the form p ∨ q, you use tactics such as apply Or.inl and apply Or.inr.
ko: 예를 들어, p ∨ q꼴의 목표에 적용했을 때, 여러분은 apply Or.inl과 apply Or.inr 같은 전략들을 사용합니다.

source: For example, with the definition of scalar multiplication below, p.smul 3 is interpreted as Point.smul 3 p.
ko: 예를 들어 아래의 스칼라 곱의 정의에서 p.smul 3은 Point.smul 3 p으로 해석됩니다.

source: For example, you can say that there are infinitely many primes by asserting that for every natural number n, there is a prime number greater than n.
ko: 예를 들어, 여러분은 모든 자연수 n에 대해 n보다 큰 소수가 있다고 주장하여 무한히 많은 소수가 있다고 말할 수 있습니다.

source: For example, you can use cases and constructor with an existential quantifier:
ko: 예를 들어, 여러분은cases와 constructor을 존재 정량자와 사용할 수 있습니다.

source: For example:
ko: 예를 들어

source: For now, notice that this is an important feature of dependent type theory: every term has a computational behavior, and supports a notion of normalization.
ko: 현재로써는 이게 의존 유형론의 중요한 특징인 것만 알아 두세요. 모든 항은 전산적 거동을 하고 정규화(normalization)의 개념을 지원합니다.

source: For one thing, cases allows you to choose the names for each alternative using a with clause.
ko: 한 가지에 대해, cases는 여러분이 with 절을 사용하여 각 대안에 대한 이름을 선택할 수 있도록 허용합니다.

source: For operations that are commutative and associative, like multiplication on the natural numbers, the simplifier uses these two facts to rewrite an expression, as well as left commutativity.
ko: 자연수 곱셈 같은 교환성과 결합성 연산자와 왼쪽 교환성과 마찬가지로 단순화기는 표현식을 다시 쓰는데 이 두 사실을 사용합니다.

source: For reference, here are two sample proofs of validities taken from the list above.
ko: 참고로 여기 위쪽의 리스트에서 가져온 유효성의 증명 예시가 두 개 있습니다.

source: For simple sugoals, it may not be worth selecting a subgoal using its tag, but you may still want to structure the proof.
ko: 간단한 하위목표에 대해 그것의 표식을 이용해 하위목표를 선택하는 것은 불필요할 수 있지만 그래도 여러분은 여전히 증명을 구조화하길 원할지도 모릅니다.

source: For structures containing many fields, this is often inconvenient, because we have to remember the order in which the fields were defined.
ko: 많은 필드를 포함한 구조체에 대해 우리는 필드가 정의된 순서를 기억해야만 하기 때문에 이것은 종종 불편합니다.

source: For that purpose, Lean provides the notion of a section:
ko: 이를 위해 Lean은 section의 개념을 제공합니다.

source: For that reason, it is common to make these arguments implicit:
ko: 이런 이유로 이런 인자를 암시적으로 만드는 것은 흔합니다.

source: For that to be the case, each of them also has to have a type.
ko: 이렇게 하는 경우에 대해 그들 각각은 유형을 가져야만 합니다.

source: For theorem names, we rely on descriptive names where the different components are separated by _s.
ko: 정리 이름에 대해, 우리는 다른 부분은 _들로 나뉜 설명하는 이름에 의존합니다.

source: For those who like precise definitions, a Lean natural number is an arbitrary-precision unsigned integer.
ko: 엄밀한 정의를 좋아하는 이들에게 린의 자연수는 부호없는 임의 정밀도의 정수입니다.

source: Formally, expressions that are the same up to a renaming of bound variables are called alpha equivalent, and are considered "the same." Lean recognizes this equivalence.
ko: 공식적으로 구속 변수의 이름이 바뀌기까지 같은 표현식은 알파 등가(alpha equivalent)라 하고 "같은" 것으로 생각합니다. 린도 이를 등가로 인식합니다.

source: From a proof of Implies p q and a proof of p, we obtain a proof of q.
ko: 증명 Implies p q과 증명p으로부터 우리는 증명 q을 얻을 수 있습니다.

source: From the constructive point of view, proofs are abstract mathematical objects that are denoted by suitable expressions in dependent type theory.
ko: 직관주의자의 관점에서 증명은 의존 유형론의 적절한 표현식으로 표기된추상적인 수학적 대상입니다.

source: Function Abstraction and Evaluation
ko: 함수 추상화와 함수값의 평가

source: Generally speaking, for an inductive type in Prop, the motive of the elimination rule is required to be in Prop.
ko: 쉽게 말하자면 Prop에 대한 귀납형에 대해 제거 규칙의 동기는 Prop에 있어야 함을 요구합니다.

source: Generally speaking, the equation compiler processes input of the following form:
ko: 폭넓게 말하자면, 방정식 컴파일러는 다음 형태의 입력을 처리합니다.

source: Given p : Point Nat, the dot notation p.x is shorthand for Point.x p.
ko: p : Point Nat에 대해서 점 기호 p.x은 Point.x p에 대한 축약 표현입니다.

source: Given α : Type and β : α → Type, think of β as a family of types over α, that is, a type β a for each a : α.
ko: α : Type과β : α → Type이라면, β를 α에 대한 유형 족(family)으로 생각할 수 있습니다. 즉, 각각의 a : α에 대해 β a유형입니다.

source: Given a proof ∀ x : α, p x and any term t : α, we obtain a proof of p t.
ko: 증명 ∀ x : α, p x과 임의의 항 t : α이 있다고 하자, 그러면 우리는 p t의 증명을 얻습니다.

source: Given a proof of p x, in a context where x : α is arbitrary, we obtain a proof ∀ x : α, p x.
ko: 임의의 x : α의 상황에서 p x의 증명이 주여졌다고 하자, 그러면 우리는 증명 ∀ x : α, p x을 얻는다.

source: Given a term s : (x : α) → β x and any term t : α, we have s t : β t.
ko: 항 s : (x : α) → β x과 임의의 항 t : α이 주어졌다고 해봅시다. 그러면 우리는 s t : β t을 가집니다.

source: Given a term t of type β x, in a context where x : α is arbitrary, we have (fun x : α => t) : (x : α) → β x.
ko: β x형의 항 t 임의의 x : α에 대해서 주어졌다고 해봅시다. 그러면 우리는 (fun x : α => t) : (x : α) → β x을 갖습니다.

source: Given an application hMul a b, after types of a and b are known, the type class synthesizer is invoked, and the resulting type is obtained from the output parameter γ.
ko: 활용 hMul a b에 대해서 a와 b의 유형이 알려진 뒤에 유형 클래스 합성기가 호출됩니다. 그리고 결과 유형은 출력 매개변수 γ로부터 얻어집니다.

source: Given an expression e of an inductive type Foo (possibly applied to some arguments), the notation e.bar is shorthand for Foo.bar e.
ko: (아마 몇 가지 인수를 적용한) 귀납형이 Foo인 표현식 e에 대해 e.bar과 같은 표기는 Foo.bar e의 약식 표현입니다.

source: Given any type α, we should be able to assign a value to each accessible element of α, recursively, by assigning values to all its predecessors first.
ko: 임의의 유형 α에 대해서 우리는 그것의 모든 전임자들을 우선으로 값을 할당하여 α의 각 접근 가능한 원소에 값을 재귀적으로 할당할 수 있어야 합니다.

source: Given that every expression in Lean has a type, it is natural to ask: what type does Type itself have?
ko: 린의 모든 표현식이 유형을 가진다면 Type 그 자체는 어떤 유형을 가져야 하는지 궁금한게 당연합니다.

source: Given the fundamental importance of inductive types in Lean, it should not be surprising that there are a number of tactics designed to work with them effectively.
ko: 린의 귀납형의 근본적인 중요성이 제시되었을 때 이들과 효과적으로 동작하도록 설계된 다수의 전략이 있는 것은 놀라운 일이 아닙니다.

source: Go back to the exercises in Chapter Propositions and Proofs and Chapter Quantifiers and Equality and redo as many as you can now with tactic proofs, using also rw and simp as appropriate.
ko: 명제와 증명과 한정기호와 동등성의 연습문제로 돌아가서 전략 증명으로 여러분이 할 수 있는 만큼 많이 다시 해보세요. rw와 simp도 적절히 사용하세요..

source: Going beyond basic notations, Lean's ability to factor out common boilerplate code into (well-behaved) macros and to embed entire custom domain specific languages (DSLs) to textually encode subproblems efficiently and readably can be of great benefit to both programmers and proof engineers alike.
ko: 기본 기호를 넘어서 흔한 상용구 코드(잘 동작하는)를 매크로로 묶고 전체 사용자 정의 도메인 특정 언어(domain specific languages, DSLs)를 포함해 하위 문제를 효율적이고 가독성있게 텍스트로 인코딩하는 린의 능력은 프로그래머와 증명 엔지니어 같은 모든 이에게 큰 이득이 될 수 있습니다.

source: Goldbach's weak conjecture states that every odd number greater than 5 is the sum of three primes.
ko: 골드바흐의 약한 추측은 5보다 큰 모든 홀수 세 소수의 합으로 표현될 수 있다고 말합니다.

source: Here are a few examples:
ko: 여기 몇 가지 예제가 있습니다.

source: Here is an example:
ko: 여기 예제가 있습니다.

source: Here (a : α) is a sequence of parameters, (b : β) is the sequence of arguments on which pattern matching takes place, and γ is any type, which can depend on a and b.
ko: 여기서 (a : α)는 매개변수의 나열입니다. 패턴 매칭이 일어나는 (b : β)은 인수의 나열입니다. 그리고 γ는 a와 b에 의존할 수 있는 임의의 유형입니다.

source: Here sampleExpr represents (v₀ * 7) + (2 * v₁).
ko: 여기서 sampleExpr이 (v₀ * 7) + (2 * v₁)을 나타냅니다.

source: Here u_1 is a variable ranging over type levels.
ko: 여기서 u_1는 어떤 유형 세계에 대한 변수입니다.

source: Here are few examples
ko: 여기 몇 가지 예제가 있습니다.

source: Here are a number of similar examples:
ko: 여기 비슷한 예제가 많이 있습니다.

source: Here are solutions to two of the more difficult ones:
ko: 여기 더 어려운 두 문제에 대한 해답이 있습니다.

source: Here are some additional examples:
ko: 여기 추가 예제가 있습니다.

source: Here are some examples of how you can declare objects in Lean and check their types.
ko: 린에서 여러분이 객체를 어떻게 선언하고 그들의 유형을 확인할 수 있는지 몇 가지 예제가 있습니다.

source: Here are some examples of structural recursion from the last chapter, now defined using the equation compiler:
ko: 이제 방정식 컴파일러를 사용해 정의될 마지막 장의 구조적 재귀에 대한 몇 가지 예제가 있습니다.

source: Here are some examples:
ko: 여기 몇 가지 예제가 있습니다.

source: Here are some more examples
ko: 여기 추가 예제가 더 있습니다.

source: Here are some more examples with lists:
ko: 여기 추가 예제가 리스트와 함께 있습니다.

source: Here are some more examples of nested pattern matching:
ko: 여기 중첩된 패턴 매칭에 대한 몇 가지 추가 예제가 있습니다.

source: Here are some of the constructions generated for the declaration above.
ko: 여기 생성자의 몇 가지가 위의 선언에 대해서 생성되었습니다.

source: Here are some simple theorems and expressions that use the generated constructions.
ko: 여기 만들어진 생성자를 사용하는 몇 가지 간단한 정리와 표현식이 있습니다.

source: Here is a better way:
ko: 여기 더 나은 방식이 있습니다.

source: Here is a more elaborate example:
ko: 여기 더 협력(elaborate)하는 예제들이 있습니다.

source: Here is a proof of p ∧ q ↔ q ∧ p:
ko: 여기 p ∧ q ↔ q ∧ p의 증명이 있습니다.
